In [1]:
import pandas as pd
import numpy as np

In [7]:
df = pd.read_csv('data/HW1-Data.csv')
df.head()

  Student ID   Test1 Homeworks  Quizzes  Presentation Fianl-Exam
0        NaN  Max:50   Max:400  Max:140           NaN    Max:100
1        NaN     NaN       NaN      NaN           NaN        NaN
2         S1      41       244      136          50.0         90
3         S2      50       400      140          50.0        100
4         S3      43       327       88          50.0         79

In [ ]:
# drop first 2 rows and start from index 0
df = df.drop(index=[0, 1])
df = df.reset_index(drop=True)
df.head()

  Student ID Test1 Homeworks Quizzes  Presentation Fianl-Exam
0         S1    41       244     136          50.0         90
1         S2    50       400     140          50.0        100
2         S3    43       327      88          50.0         79
3         S4    43       336     123          50.0         35
4         S5    41       232     100          50.0         79